{
    "id": 1183311,
    "url": "https://api.case.law/v1/cases/1183311/",
    "name": "THE PEOPLE, Plaintiff and Respondent, v. DWIGHT WILBUR BRADLEY, Defendant and Appellant",
    "name_abbreviation": "People v. Bradley",
    "decision_date": "1969-10-31",
    "docket_number": "Crim. No. 12806",
    "first_page": "80",
    "last_page": "92",
    "citations": [
        {
            "type": "official",
            "cite": "1 Cal. 3d 80"
        }
    ],
    "volume": {
        "url": "https://api.case.law/v1/volumes/32044078455763/",
        "volume_number": "1"
    },
    "reporter": {
        "url": "https://api.case.law/v1/reporters/418/",
        "full_name": "California Reports"
    },
    "court": {
        "url": "https://api.case.law/v1/courts/cal/",
        "id": 9021,
        "slug": "cal",
        "name": "Supreme Court of California",
        "name_abbreviation": "Cal."
    },
    "jurisdiction": {
        "url": "https://api.case.law/v1/jurisdictions/cal/",
        "id": 30,
        "slug": "cal",
        "name": "Cal.",
        "name_long": "California",
        "whitelisted": false
    },
    "casebody": {
        "status": "ok",
        "data": {
            "attorneys": [],
            "opinions": [
                {
                    "type": "majority",
                    "text": "Opinion\nBURKE, J.\nA court, sitting without a jury, found defendant guilty of possession of marijuana (Health & Saf. Code, § 11530) and possession of marijuana for sale (Health & Saf. Code, § 11530.5). He admitted prior felony convictions for possession of narcotics (Health & Saf. Code, § 11500) and possession of marijuana (Health & Saf. Code, § 11530).\nDefendant appeals from the judgment, contending that the court erred in admitting, over objection, evidence of marijuana plants found in the yard adjacent to his residence and marijuana and narcotics paraphernalia found inside his house, We have concluded that the evidence of the marijuana plants was properly admitted but that the evidence found inside his house should have been excluded because the officers’ entry into the house was unlawful and that the error in admitting this evidence was prejudicial.\nOn July 28, 1967, Deputy Sheriff Narron, an experienced narcotics officer, was told by an informer of unknown reliability that defendant had marijuana in his house, was engaged in selling it, and was on parole for its possession. The informer also gave information concerning defendant’s car. The next evening the same informer told Narron that defendant was growing marijuana by a fig tree at the rear of his residence.\nAfter receiving this second report, Narron went to defendant’s address about 9 p.m. on July 29, 1967. The premises included a house that faced the street; a driveway that ran along the east of the house and terminated in a garage at the rear and east of the house; defendant’s residence which was attached to the rear of the garage; and a large “fenced in yard” to the west of defendant’s residence. The extent and the manner of the fencing are not disclosed by the record.\nNarron, noticing that defendant’s car was gone, believed he was away and went into the “rear yard area” to investigate. There he saw a marijuana plant in a keg two or three feet from the base of a fig tree that was about 20 feet from defendant’s door. The officer did not know if the tree was in the backyard of the owner (who presumably lived in the front house) or of defendant. It was necessary for the officer to be within almost a foot of the tree to distinguish the marijuana plant. According to the officer, the keg was “partially covered by the leaves and the limbs of the fig tree.” When later asked if the “marijuana plant was hidden under the fig tree,” the officer replied, “I don’t believe you could say exactly hidden, however, it was covered by foliage.” He did not have a search warrant.\nAfter leaving defendant’s premises Narron went to the sheriff’s office where he obtained a photograph of defendant and from a record check ascertained he had been, but was no longer, on parole for “narcotics.” Narron tried to obtain a search warrant but was unsuccessful due to the unavailability of a judge.\nNarron, accompanied by four other officers, then returned to defendant’s residence about 3:15 a.m. on July 30, 1967. At this time Narron ascertained that there were three marijuana plants in the keg. The largest one was about two and a half feet tall; the others about a foot and a half tall. One of the officers stayed to guard the plants.\nNarron and the other officers approached defendant’s residence. The door was fully open. From the outside Narron, with the aid of a flashlight, saw a man who appeared to be asleep on a bed. Without asking permission or speaking to defendant, the officers entered. Narron testified that “as I went into the living room area, the defendant . . . raised on his side as I was approximately half way across the room.” Narron showed his “I.D.,” illuminated by a flashlight, and identified himself. Another officer in uniform was by him. The officers told defendant he was under arrest for possession of marijuana and informed him of his “constitutional rights.” When asked whether he minded if a search was made of the house, defendant replied, “No, go ahead.” An ensuing search disclosed marijuana and specified narcotics paraphernalia.\nDefendant contends that Officer Narron’s discovery and seizure of the marijuana plants in the yard violated the Fourth Amendment of the United States Constitution, made applicable to the states by the Fourteenth Amendment (Mapp v. Ohio, 367 U.S. 643, 655-657 [6 L.Ed.2d 1081, 1089-1091, 81 S.Ct. 1684, 84 A.L.R.2d 933].) The Fourth Amendment provides, “The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated . . . .” An essentially identical guarantee of personal privacy is contained in article I, section 19, of the California Constitution.\nA number of cases in upholding searches in open fields or grounds around a house have stated their conclusions in terms of whether the place was a “constitutionally protected area,” (See, e.g., cases cited in People v. Edwards, 71 Cal.2d 1096 [80 Cal. Rptr. 633,458 P.2d 713]). Thatphrase, however, does not afford a solution to every case involving a claim of an illegal search and seizure (see Katz v. United States, 389 U.S. 347, 350-352 [19 L.Ed.2d 576, 581-582, 88 S.Ct. 507]), and we believe that an appropriate test is whether the person has exhibited a reasonable expectation of privacy, and, if so, whether that expectation has been violated by unreasonable governmental intrusion (People v. Edwards, 71 Cal.2d 1096 [80 Cal.Rptr. 633, 458 P.2d 713], and cases cited therein).\nMeasured by that test we are satisfied that the officer’s discovery and seizure of the marijuana plants in the yard adjacent to defendant’s residence did not violate the constitutional prohibitions against unreasonable searches and seizures. From the recited evidence it may be inferred that the marijuana plants were partially but not totally covered by foliage. It does not appear that the plants were covered by nontransparent material, and it may be inferred that at least part of the plants were in plain sight of anyone within a foot of the tree. Although they were in a rear yard that was fenced to an undisclosed extent, they were located a scant 20 feet from defendant’s door to which presumably delivery men and others came, and the front house, as well as defendant’s house, apparently had access to the yard. Under the circumstances it does not appear that defendant exhibited a subjective expectation of privacy as to the plants. Furthermore, any such expectation would have been unreasonable. (Cf., e.g., Hester v. United States, 265 U.S. 57 [68 L.Ed. 898, 44 S.Ct. 445]; People v. Terry, 70 Cal.2d 410, 427-428 [77 Cal.Rptr. 460, 454 P.2d 36]; People v. Alexander, 253 Cal.App.2d 691, 700 [61 Cal.Rptr. 814]; see Katz v. United States, supra, 389 U.S. 347, 361 [19 L.Ed.2d 576, 587, 88 S.Ct. 507] [concurring opinion by Harlan, J., containing statements to the effect that there is no reasonable expectation of privacy in an open field or with respect to “conversations in the open”].)\nBielicki v. Superior Court, 57 Cal.2d 602 [21 Cal.Rptr 552, 371 P.2d 288], and Britt v. Superior Court, 58 Cal.2d 469 [24 Cal.Rptr. 849, 374 P.2d 817], cited by defendant, differ from the instant cases. In the cited cases unlawful conduct of the petitioners in public toilets, which were enclosed by three walls and a door, was observed by officers through a pipe installed through the roof in one case and through vents in the other, and this court condemned the officers’ conduct as constituting exploratory searches. There the officers’ surveillance, because of the character of the place to which it was directed, violated the petitioners’ right of privacy. The character of the place here in question (i.e. the yard near the defendant’s door) manifestly is totally dissimilar to an enclosed toilet stall.\nDefendant’s reliance on Wattenburg v. United States, 388 F.2d 853, 857, is misplaced. He points to the statement in Wattenburg that “it seems to us a more appropriate test [than one based on curtilage] in determining if a search and seizure adjacent to a house is constitutionally forbidden is whether it constitutes an intrusion upon what the resident seeks to preserve as private even in an area which, although adjacent to his home, is accessible to the public.” The court applied this test and concluded that Wattenburg, in placing a stockpile of Christmas trees in the backyard of the motel where he resided, not more than 35 feet therefrom, sought to protect it from the search and that the search and the seizure of trees from the stockpile were therefore illegal as to him. In Wattenburg, unlike the instant case, the recited facts do not show that any part of the objects seized was visible to a person nearby on the premises. Rather it appears that the objects (i.e. trees) “were seized from the stockpile” during a search which lasted over six hours. The seized trees thus apparently were covered by other trees, evidence that Wattenburg exhibited a subjective expectation of privacy. Furthermore, although we are bound by decisions of the United States Supreme Court interpreting the federal Constitution (Moon v. Martin, 185 Cal. 361, 366 [197 P. 77]; Mackenzie v. Hare, 165 Cal. 776, 779 [134 P. 713, Ann. Cas. 1915B 261, L.R.A. 1916D 127] [affd. 239 U.S. 299 [60 L.Ed. 297, 36 S.Ct. 106]], we are not bound by the decisions of the lower federal courts even on federal questions. However, they are persuasive and entitled to great weight. (Rohr Aircraft Corp. v. County of San Diego, 51 Cal.2d 759, 764-765 [336 P.2d 521] [revd., without comment on this point, 362 U.S. 628 [4 L.Ed.2d 1002, 80 S.Ct. 1050]]; Stock v. Plunkett, 181 Cal. 193, 194-195 [183 P. 657]; People v. Willard, 238 Cal.App.2d 292, 305 [47 Cal.Rptr. 734]; People v. Estrada, 234 Cal.App.2d 136, 145 [44 Cal.Rptr. 165, 11 A.L.R.3d 1307].)\nDefendant next contends that the officers’ unannounced intrusion into his home at night was in violation of Penal Code section 844 and that therefore the arrest and subsequent search and seizure were illegal. Section 844 provides: “To make an arrest, ... a peace-officer, may break open the door or window of the house in which the person to be arrested is, or in which [the officer has] reasonable grounds for believing him to be, after having demanded admittance and explained the purpose for which admittance is desired.” (Italics added.)\nHere it does not appear that the officers demanded admittance and explained the purpose for which admittance was desired before their entry, but the Attorney General argues that section 844 is inapplicable because, he asserts, the entry through the open door was not a “breaking” within the meaning of this section.\nThe rule of announcement was early set forth in Semayne’s Case (1603) 77 Eng. Rep. 194, which states, “. . . In all cases when the King ... is party, the sheriff (if the doors be not open) may break the party’s house, either to arrest him, or to do other execution of the K’s process, if otherwise he cannot enter. But before he breaks it, he ought to signify the cause of his coming, and to make request to open doors. . . .” (See generally, Blakey, The Rule of Announcement and Unlawful Entry, 112 U.Pa. L.Rev. 499, 500 et seq; Wilgus, Arrest Without a Warrant, 22 Mich. L.Rev. 798, 800-807.)\nThe demand and explanation requirements of section 844 are a codification of the common law. (People v. Rosales, 68 Cal. 2d 299, 303 [66 Cal.Rptr. 1, 437 P.2d 489]; People v. Maddox, 46 Cal.2d 301, 306 [294 P.2d 6].) Rosales, in rejecting a claim that opening an unlocked screen door and walking in was not a breaking within the meaning of section 844, stated that at the very least the section covers unannounced entries that would be considered breaking as that term is used in defining common law burglary and that as so defined no more is needed “than the opening of a door or window, even if not locked, or not even latched. Pulling open a screen door held closed only by a spring is sufficient.” We further stated in Rosales (at p. 304) that “Section 844 is designed to protect fundamental rights. ‘Decisions in both the federal and state courts have recognized, as did the English courts, that the requirement is of the essence of the substantive protections which safeguard individual liberty.’ (Ker v. California (1962) 374 U.S. 23, 49 . . . Brennan, J. dissenting.) The statute reflects more than concern for the rights of those accused of crime. It serves to preclude violent resistance to unexplained entries and to protect the security of innocent persons who may also be present on premises where an arrest is made.”\nIn Sabbath v. United States, 391 U.S. 585 [20 L.Ed.2d 828, 88 S.Ct 1755], a federal statute substantially identical to Penal Code section 844 was interpreted in accord with People v. Rosales, supra, 68 Cal.2d 299, to apply to opening a closed but unlocked door. The court stated in part (at p. 589 [20 L.Ed.2d at p. 833]), “. . . the statute uses the phrase ‘break open’ and that connotes some use of force. But linguistic analysis seldom is adequate when a statute is designed to incorporate fundamental values and the on-going development of the common law.”\nThe Legislature in codifying common law rules does not necessarily freeze the law to the rules existing at common law. (See e.g. People v. Spriggs, 60 Cal.2d 868, 871 [36 Cal.Rptr. 841, 389 P.2d 377].) Questions arise on which the Legislature has been silent or inexplicit, and the courts must answer these questions in the light of common law principles and the basic objectives of the legislation (see People v. Spriggs, supra, at p. 872; Stone, The Common Law in the United States, 50 Harv. L.Rev. 4; Pound, Common Law and Legislation, 21 Harv. L.Rev. 383, 388.)\nAlthough section 844 codified the common law rule requiring peace officers to demand admittance and explain their purpose before they break open a door or window, the section is silent or inexplicit as to whether the officers must make such a demand and explanation before they enter a house through an open door. Even if at common law an unannounced intrusion through an open door was lawful, we are satisfied in view of the purposes of section 844, as stated in People v. Rosales, supra, 68 Cal.2d 299, 304, that the demand and explanation requirements of that section also apply where, as here, officers walk into a dwelling through an open door at nighttime when the occupant apparently is asleep.\n1\nUnder the circumstances here appearing there was a breaking within the meaning of the section. The consequences of such an unannounced intrusion could be resistance to the intruders and violent death or injury to them or others including innocent third parties. The burden of complying with the demand and explanation requirements of section 844 is slight, and in view of the special circumstances under which noncompliance with section 844 is excused, insistence upon compliance in the absence of those circumstances in a case like the instant one should not result in any undue impairment of lawful police action.\nPeople v. Hamilton, 257 Cal.App.2d 296, 300-302 [64 Cal.Rptr. 58], which contains dictum that section 844 “leaves the law of arrests where the common law left it” and that an officer may enter an open door without warning, is disapproved insofar as it is inconsistent with the views expressed herein.\n2\n“Noncompliance with section 844 may ... be excused when the officer acts on a reasonable and good faith belief that compliance would increase his peril, frustrate an arrest, or permit the destruction of evidence. Such a belief, however, must be based on the facts of the particular case. It cannot be justified by a general assumption that certain classes of persons subject to arrest are more likely than others to resist arrest, attempt to escape, or destroy evidence. [Citation.]” (People v. Rosales, supra, 68 Cal.2d 299, 305.) Here the Attorney General does not claim, nor does it appear, that noncompliance with section 844 was excused.\nSince the entry was unlawful, it vitiated the lawfulness of the arrest and subsequent search and required exclusion of the evidence obtained in that search. (People v. Kanos, 70 Cal.2d 381, 384 [74 Cal.Rptr. 902, 450 P.2d 278]; People v. Rosales, supra, 68 Cal.2d 299, 302.)\n3\nThe admission of that evidence requires reversal of the judgment on both counts. The marijuana and narcotics paraphernalia found in the search of the house manifestly were highly prejudicial, and, although as we have seen the marijuana plants in the yard were not obtained by an illegal search, the properly admitted evidence that defendant had possession of those plants was not overwhelming. From the recited evidence it appears that the officer did not know whether the plants were in the yard of defendant or the owner. Under the circumstances it is clear that the error in admitting the evidence found in the house contributed to the judgment. (Chapman v. California, 386 U.S. 18, 21-24 [17 L.Ed.2d 705, 708-710, 78 S.Ct. 824, 24 A.L.R.3d 1065]; People v. Watson, 46 Cal.2d 818, 835-837 [299 P.2d 243]; People v. Marshall, 69 Cal.2d 51, 62 [69 Cal.Rptr. 585, 442 P.2d 665].)\nThe judgment is reversed.\nTraynor, C. J., McComb, J., and Mosk, J., concurred.\n1 People v. Beamon, 268 Cal.App.2d 61, 64 [73 Cal.Rptr. 604], broadly states that an officer may not enter through an open door without first complying with the demand and explanation requirements of section 844 unless compliance is excused under one of the established exceptions to the section, and Beamon concluded that under the circumstances there appearing compliance was excused. We need not decide here whether the broad statement in Beamon is correct. We hold merely that under the circumstances of the instant case compliance with the demand and explanation requirements of section 844 was necessary. We intimate no view whether in the absence of an excuse for compliance under the exceptions to section 844 the demand and explanation requirements of that section apply to all entries through an open door (including e.g. entrance through an open door by a uniformed officer during the day where immediately after crossing the threshold he announces himself and his purpose). In order to avoid any possible illegality, however, it would be advisable for officers before entering a house through an open door to make an arrest to always demand admittance and explain the purpose for which they desire admittance unless the case comes within an established exception to section 844.\n2 In support of the dictum that an officer may enter an open door without warning Hamilton cited United States v. Williams (6th Cir. 1965) 351 F.2d 475. Williams stated that a state statute similar.to section 844 was not of assistance on the question whether a search following an unannounced entrance by officers through an open door was lawful and that the Fourth Amendment was not violated by a search following such an entrance under the circumstances there appearing. (See also Hopper v. United States (9th Cir. 1959) 267 F.2d 904, 908.) However, other federal courts in interpreting a federal statute similar to section 844 have stated that any entry without permission is a breaking. (See, e.g. Keiningham v. United States (D. C. Cir. 1960) 287 F.2d 126, 130 [109 App. D. C. 272].)\n3 No claim is, or properly could be, made that the search was lawful because it was pursuant to defendant’s consent. “A search and seizure made pursuant to consent secured immediately following an illegal arrest or entry . . . are inextricably bound up with the illegal conduct and cannot be segregated therefrom.” (People v. Haven, 59 Cal.2d 713, 719 [31 Cal.Rptr. 47, 381 P.2d 927]; People v. Henry, 65 Cal.2d 842, 846 [56 Cal.Rtpr. 485, 423 P.2d 557].)",
                    "author": "BURKE, J."
                },
                {
                    "type": "concurring-in-part-and-dissenting-in-part",
                    "text": "TOBRINER, J.,\nConcurring and Dissenting—I concur in the opinion of the majority that the marijuana and narcotics equipment found in Bradley’s house were seized in violation of Penal Code section 844, and must be excluded from evidence. The majority reach this conclusion in the following language: “Although section 844 codified the common law rule requiring peace officers to demand admittance and explain their purpose before they break open a door or window, the section is silent or inexplicit as to whether the officers must make such a demand and explanation before they enter a house through an open door. Even if at common law an unannounced intrusion through an open door was lawful, we are satisfied in view of the purposes of section 844, as stated in People v. Rosales ... 68 Cal.2d 299, 304, that the demand and explanation requirements of that section also apply where, as here, officers walk into a dwelling through an open door at nighttime when the occupant apparently is asleep.” (Ante, p. 87 [81 Cal.Rptr. 457, 460 P.2d. 129].) This language is unduly restrictive, and invites unnecessary litigation of cases involving daytime entries, and entries upon awakened or apparently awakened occupants.\nSection 844 serves to protect the privacy of occupants (see Miller v. United States (1958) 357 U.S. 301, 313-314 [2 L.Ed.2d 1332, 1340-1341, 78 S.Ct. 1190]) and the safety of occupants, policemen, and bystanders (see People v. Rosales (1968) 68 Cal.2d 299, 304 [66 Cal.Rptr. 1, 437 P.2d 489].) I cannot accept the limiting language of the majority opinion in the light of these objectives: the intrusion upon privacy does not depend upon the time of day; an awake occupant is perhaps more likely to offer violent resistance than a sleeping one. In People v. Beamon (1968) 268 Cal.App. 2d 61, 64-65 [73 Cal.Rptr. 604], the Court of Appeal stated: “In our opinion an open door does not excuse noncompliance with section 844 unless noncompliance is otherwise excused under the rules declared in Rosales. Accordingly, a police officer may not enter through an open door of a house without first demanding admittance and explaining the purpose for which admittance is desired unless he reasonably and in good faith believes that such compliance would increase his peril, frustrate an arrest, or permit the destruction of evidence. We are persuaded to this conclusion by the purpose of section 844 as declared in Rosales and by the clear language of the section which does not restrict the required announcement to any particular type of entry by the police officers .... Moreover, if analogy to the law of burglary is required, we note that in California no breaking or fórceable entry is required in proof of the commission of a burglary . . . and, accordingly, that a burglary can be committed by entering through an open door or window.”\nI believe that the Court of Appeal in Beamon correctly interpreted our decision in Rosales. I would therefore hold that the officers’ entry in the instant case violated section 844 not because they entered upon a sleeping occupant at night, but simply because there was neither substantial compliance with section 844 nor excuse for noncompliance.\nI concur also in the majority’s reasoning that the protection of the Fourth Amendment is not limited to buildings, nor delimitated by common law definitions of the curtilage, but extends “wherever an individual may harbor a reasonable ‘expectation of privacy.’ ’’\n1\n(Terry v. Ohio (1968) 392 U.S. 1, 9 [20 L.Ed.2d 889, 898, 88 S.Ct. 1868]); see Katz v. United States (1967) 389 U.S. 347, 361 [19 L.Ed.2d 576, 587, 88 S.Ct. 507] (concurring opinion of Harlan, J.), and p. 351 [19 L.Ed.2d at p. 581]; Britt v. Superior Court (1962) 58 Cal.2d 469 [24 Cal.Rptr. 849, 374 P.2d 817]; Bielicki v. Superior Court (1962) 57 Cal.2d 602 [21 Cal.Rptr. 552, 371 P.2d 288]; People v. Willard (1965) 238 Cal.App.2d 292 [47 Cal.Rptr. 734]. I disagree, however, in the application of this reasoning to the marijuana plants offered in evidence.\nThe marijuana plants were located in a keg under a fig tree in a back yard which was entirely or partially fenced. They were not on a portion of the property open to the general public, nor to implied invitees such as mailmen, milkmen, trash collectors (compare People v. Edwards, supra, 71 Cal.2d 1096) and the like. They were implanted about 20 feet from defendant’s door and apparently could not be seen—or at least not seen clearly enough to be identified as marijuana—until the searcher approached to within a foot of the plants. The defendant could reasonably expect that members of the public calling at his residence would stay in the approximate vicinity of the door and pathway, would see only what can be seen from that viewpoint, and that the balance of the yard was private.\n2\nThe recent decision of the Ninth Circuit in Wattenburg v. United States (9th Cir. 1968) 388 F.2d 853, offers strong support for this position. In that case the defendant stole about 1,000 red fir trees from federal land and piled them about 35 feet behind his motel. Federal investigators cut cross-sections from nine stumps on the land, and without a valid warrant searched through the pile of trees to find the nine trees which matched the stumps. The court held the search unlawful, since it constituted “an intrusion upon what the resident seeks to preserve as private even in an area which, although adjacent to his home, is accessible to the public.” (P. 857.)\nThe grounds advanced in the majority opinion to distinguish this case appear insufficient. Although the 1,000 fir trees must have been highly conspicuous from the motel 35 feet away, no evidence in the instant case indicates whether the marijuana plants were visible from Bradley’s doorway. Despite the implication of the majority opinion, there is no evidence in Wattenburg that the nine trees were covered by other trees, or deliberately hidden by the defendant; one would assume they were not deliberately concealed, since Wattenburg had no knowledge of which stumps the investigators would cross-section. The instant case is a stronger case for exclusion than Wattenburg: a motel is a more public place than a private walk, and in Wattenburg stolen property was visible from the place open to the public.\nPeople v. Edwards, supra, 71 Cal.2d 1096, also supports defendant’s right to exclude the evidence. In that case we held a search of a trash can 2-3 feet from Edwards’s back door unlawful. Edwards’s trash can was covered, but such coverage was essential to insure its privacy since it was located where various members of the public would pass by, including, of course, the trash collector. Bradley’s plants were not covered, but such coverage was not essential to insure their privacy since the plants could not be recognized from any area open to the public. The key similarity is that in both cases evidence in the back yard of a residence was not visible from the doorstep, walkway, or other place where visitors might be. It was, in short, located in a place where it was relatively safe from public intrusion, or so the occupant could reasonably believe. The trash can cannot logically be distinguished from the marijuana plants.\nThis case does not deal with “open fields,” but with the yard adjacent to a private residence. (Compare Hester v. United States (1924) 265 U.S. 57 [68 L.Ed. 898, 44 S.Ct. 445].) The resident cannot reasonably expect privacy in those portions of the yard open to the public, or if not to the public, at least to a substantial number of people. (Compare People v. Terry, supra, 70 Cal.2d 410, permitting a search in the common garage of a large apartment building.) Nor can he expect privacy for things in plain sight from such public areas. (People v. Terry, supra, 70 Cal.2d 410; People v. Willard, supra, 238 Cal.App.2d 292.) But he can reasonably, and probably does, expect privacy for the remainder of the property. No evidence in this case shows that the marijuana plants could be seen until the officer left the area open to the public and approached to a point approximately one foot from the plants. Consequently, the evidence must be excluded.\nPeters, J., and Sullivan, J., concurred.\n1 The majority opinion in this ease, and that in People v. Edwards,_ proposes the test: “whether the person has exhibited a reasonable expectation of privacy.” (Ante, p. 84 [81 Cal.Rptr. 457, 460 P.2d 129]; People v. Edwards (1969) 71 Cal.2d 1096, 1104 [80 Cal.Rtpr. 633, 458 P.2d 713].) (Italics added.) Although there may be no significant difference between this language and “may harbor a reasonable expectation of privacy,” I prefer the latter language, because I wish to avoid any suggestion that the expectation of privacy must be demonstrated by an overt act of defendant, or that evidence that a defendant did or did not deliberately try to hide the item should be decisive.\n2 An area not open to the public generally may be open to such a large number of persons that no one of them could reasonably expect privacy. Examples are the common hallways of apartments, or the apartment garage in People v. Terry (1969) 70 Cal.2d 410, 427 [77 Cal.Rptr. 460, 454 P.2d 36], which held 5 to 105 cars. An area open only to occupants of two adjoining residences, however, is still an area which may lend itself to a sense of privacy.",
                    "author": "TOBRINER, J.,"
                }
            ],
            "judges": [],
            "parties": [
                "THE PEOPLE, Plaintiff and Respondent, v. DWIGHT WILBUR BRADLEY, Defendant and Appellant."
            ],
            "head_matter": "In Bank.\n[Crim. No. 12806.\nTHE PEOPLE, Plaintiff and Respondent, v. DWIGHT WILBUR BRADLEY, Defendant and Appellant.\nOct. 31, 1969.]\nCounsel\nPeter Clarke, under appointment by the Supreme Court, for Defendant and Appellant.\nThomas C. Lynch, Attorney General, William E. James, Assistant Attorney General, and Mark L. Christiansen, Deputy Attorney General, for Plaintiff and Respondent."
        }
    }
}