{
    "id": 1979986,
    "url": "https://api.case.law/v1/cases/1979986/?format=json",
    "name": "THE PEOPLE, Plaintiff and Respondent, v. BENJAMIN JAMIE CARDENAS, Defendant and Appellant",
    "name_abbreviation": "People v. Cardenas",
    "decision_date": "1982-07-08",
    "docket_number": "Crim. No. 21870",
    "first_page": "897",
    "last_page": "918",
    "citations": [{
        "type": "official",
        "cite": "31 Cal. 3d 897"
    }],
    "volume": {
        "url": "https://api.case.law/v1/volumes/32044078600780/?format=json",
        "volume_number": "31"
    },
    "reporter": {
        "url": "https://api.case.law/v1/reporters/418/?format=json",
        "full_name": "California Reports"
    },
    "court": {
        "url": "https://api.case.law/v1/courts/cal/?format=json",
        "id": 9021,
        "slug": "cal",
        "name": "Supreme Court of California",
        "name_abbreviation": "Cal."
    },
    "jurisdiction": {
        "url": "https://api.case.law/v1/jurisdictions/cal/?format=json",
        "id": 30,
        "slug": "cal",
        "name": "Cal.",
        "name_long": "California",
        "whitelisted": false
    },
    "casebody": {
        "data": {
            "judges": [],
            "attorneys": ["Counsel", "Robert S. Gerstein, under appointment by the Supreme Court, for Defendant and Appellant.", "George Deukmejian, Attorney General, Robert H. Philibosian, Chief Assistant Attorney General, S. Clark Moore, Assistant Attorney General, Gary R. Hahn, Norman H. Sokolow and William V. Ballough, Deputy Attorneys General, for Plaintiff and Respondent."],
            "parties": ["THE PEOPLE, Plaintiff and Respondent, v. BENJAMIN JAMIE CARDENAS, Defendant and Appellant."],
            "head_matter": "[Crim. No. 21870.\nTHE PEOPLE, Plaintiff and Respondent, v. BENJAMIN JAMIE CARDENAS, Defendant and Appellant.\nJuly 8, 1982.]\nCounsel\nRobert S. Gerstein, under appointment by the Supreme Court, for Defendant and Appellant.\nGeorge Deukmejian, Attorney General, Robert H. Philibosian, Chief Assistant Attorney General, S. Clark Moore, Assistant Attorney General, Gary R. Hahn, Norman H. Sokolow and William V. Ballough, Deputy Attorneys General, for Plaintiff and Respondent.",
            "opinions": [{
                "text": "Opinion\nBIRD, C. J.\nThis case raises two questions concerning the admissibility of evidence in appellant’s criminal trial. Should the trial court have excluded testimony concerning the common membership of appellant and his defense witnesses in a youth gang? In addition, was evidence of appellant’s addiction to narcotics admissible in an attempt to prove his guilt of the charged offenses?\nI.\nAppellant Benjamin Cardenas was convicted of attempted murder in the first degree (Pen. Code, §§ 664, 187);\n1\nattempted robbery (§§ 664, 211); and assault with a deadly weapon or by force likely to produce great bodily injury (§ 245, subd. (a)). The trial court sentenced appellant to prison for the upper term for attempted murder and a consecutive term for attempted robbery. Each sentence was enhanced by a finding of firearm use (§ 12022.5), and the attempted robbery term was enhanced by a finding of infliction of great bodily injury (§ 12022.7). To avoid the multiple punishment proscriptions of section 654, the court imposed no term for assault with a deadly weapon. Appellant’s total prison sentence amounted to 13 years, 2 months.\nThe issue at appellant’s trial was whether appellant was the perpetrator of the crimes. The testimony was sharply conflicting.\nLeo Morgan, Larry Blacksmith, and Steve Van Mierlo (Steve) were working in a 7-Eleven store at 6 p.m. one evening when a man with a gun entered and ordered all three men to lie face-down on the floor. Morgan (the store manager) and Blacksmith saw the man for five to ten seconds before complying with his order. Steve “took a glance” at the man for one second. The man commanded Steve to open the store safe, and Steve complied. However, Morgan was shot in the back, and a struggle ensued between Blacksmith and the intruder, who eventually dropped his gun and fled. Steve’s brother Paul happened to be riding his bicycle past the store as these events were occurring. He saw only the back of the man, who jumped into a car and drove away.\nMorgan described the robber as 5'7\" tall and weighing 150 pounds. Steve stated the robber was 5'9\" tall and 160 pounds. Blacksmith also estimated the man’s height at 5'8\" or 5'9\" and set the weight at 170 to 180 pounds. Morgan and Blacksmith said the intruder was clean shaven. Steve testified he had a moustache and beard.\nAppellant was arrested for the robbery attempt five days after its commission. When he was booked into jail, the police listed his height as 5'2\" and his weight as 140 pounds.\nDuring the week following the drime, the three store employees and the bicyclist Paul were shown photographic lineups consisting of mug shots. Blacksmith, Steve, and Paul pointed out appellant’s photograph but indicated they were uncertain it depicted the robber.\n2\nMorgan saw two photographic lineups, but made no identification the first time. Instead, he indicated that a mug shot of someone other than appellant had characteristics similar to those of his assailant. Morgan later reviewed another photographic lineup and selected appellant’s photograph on this occasion.\nTwelve days after the crime, Steve, Blacksmith, and Paul attended a lineup. Blacksmith selected appellant but was uncertain he was the assailant. The other two were positive. Steve based his identification on the similarity between appellant’s hair and moustache and the hair and moustache of the assailant. Paul initially could not explain why he had selected appellant. Later, he testified that he picked appellant out by viewing his back when appellant turned around during the lineup. Morgan subsequently was shown a videotape of the lineup, but was unable to make any identification. He indicated that someone in the lineup other than appellant resembled his assailant. All four witnesses identified appellant at the trial.\nAppellant sought to establish that he was not the perpetrator of the robbery attempt. Three witnesses — Robert and Elizabeth Reeves, and Steve Valenzuela — testified that appellant was visiting the Reeves’ home at the time of the commission of the crime. Other witnesses —Tony Ozaeta and Virginia Cardenas (appellant’s sister-in-law) — testified to appellant’s whereabouts earlier that day.\nThe prosecutor was permitted to attack the credibility of the defense witnesses by eliciting testimony from them that they and appellant were members of a youth gang or “group” known as El Monte Flores. Two of the male witnesses were asked to exhibit to the jury their gang tattoos on their forearms and hands. The prosecution also sought to introduce evidence that there were other “groups” in the town of El Monte and that the members of those “groups” were not welcome to “join” the El Monte Flores gang.\nThe prosecutor was also permitted by the trial court to elicit testimony concerning appellant’s narcotics habit to establish that appellant had tried to rob the store to obtain money to support that habit. Mark Howard, a police officer with the El Monte Narcotics Task Force, testified that at the time of arrest, his pupils were dilated and his elbows showed recent puncture wounds and scar tissue related to heroin use. The old scar tissue, Howard said, showed that appellant had been addicted to heroin over a long period of time. Howard had had ten to twenty contacts with appellant over the previous five to six years. On at least one of those occasions, appellant had been arrested for being under the influence of a controlled substance. Howard also testified that the puncture wounds indicated that appellant had recently been “strung out,” that it “looked like it was very recent that he [appellant] began to use a lot frequently.” Howard estimated the cost of appellant’s habit at a “minimum of $25 and maybe up to $75 per day.”\nThe prosecutor questioned Robert Reeves and Gus Collinsworth (appellant’s parole officer) about appellant’s narcotics use. Reeves said that appellant had previously been in a “detox” program. Collinsworth stated that he knew about appellant’s drug problems because appellant had asked for assistance in obtaining treatment.\nII.\nAppellant contests the admission at his trial of the testimony concerning gang membership and drug use. He claims that the trial court should have excluded the evidence of common membership in the El Monte Flores gang on the basis of Evidence Code section 352.\nWhen a section 352 objection is raised, the trial court “must weigh the admission of [the challenged] evidence carefully in terms of whether the probative value of the evidence is greater than the potentially prejudicial effect its admission would have on the defense.” (People v. Perez (1981) 114 Cal.App.3d 470, 478 [170 Cal.Rptr. 619].) If the prejudicial effect outweighs the probative value, the trial court should exclude the evidence. “[T]he fundamental rule [is] that relevant evidence whose probative v^lue is outweighed by its prejudicial effect should not be admitted.” (People v. Haston (1968) 69 Cal.2d 233, 246 [70 Cal.Rptr. 419, 444 P.2d 91].)\nIn this case, the trial court abused its discretion by allowing the prosecution to introduce evidence that appellant and his witnesses were affiliated with the El Monté Flores youth gang.\nThe probative value of the gang membership evidence was minimal at best. The evidence was offered to establish possible bias of the defense witnesses in favor of appellant. The prosecution sought to prove that the witnesses and appellant “livefd] in the same neighborhood” and “had the same circle of friends.” However, these facts had already been amply established by other testimony before the prosecutor began his inquiries into the witnesses’ gang affiliations. All of the defense witnesses testified that they were friends of appellant and lived in the same neighborhood as he.\n3\nEach of the male witnesses and appellant also belonged to the San Gabriel Valley Boys Club where they played basketball.\nOn the basis of this evidence, there could have been no doubt in the jurors’ minds that appellant and his male witnesses were neighborhood friends. The fact that appellant and the witnesses were also members of the Flores gang was cumulative and added little to further the prosecution’s objective of showing that the witnesses were biased because of their close association with appellant. (See 1 Jefferson, Cal. Evidence Benchbook (2d ed. 1982) § 22.1, p. 589.)\nNot only did the common gang membership evidence have limited probative value, but its admission created a substantial danger of undue prejudice. There was a real danger that the jury would improperly infer that appellant had a criminal disposition because (1) the El Monte Flores was a youth gang; (2) such gangs commit criminal acts; and (3) appellant was a member of the Flores gang.\nIn Southern California, Chicano youth gangs have received widespread media publicity for their purported criminal activities. In this case, the prosecutor did not specifically refer to the El Monte Flores as a youth gang. However, the jury undoubtedly identified the group as such, either from their personal knowledge or from their in-court observations of the witnesses’ age, ethnicity, and tattoos.\n“[T]he prosecution has no right to present cumulative evidence which creates a substantial danger of undue prejudice to the defendant.” (People v. De La Plane (1979) 88 Cal.App.3d 223, 242 [151 Cal.Rptr. 843].) Yet, this is precisely what occurred during appellant’s trial. Admission of the evidence of common gang membership constituted an abuse of the trial court’s discretion under Evidence Code section 352.\nIn addition to this abuse of discretion, error also occurred when the prosecutor’s inquiries concerning the El Monte Flores gang went beyond merely ascertaining whether particular witnesses were members of the gang. On at least two occasions, the prosecutor posed questions which exceeded the asserted purpose for which he had sought admission of the gang membership evidence.\nOver defense objection, the prosecution sought to elicit from defense witness Tony Ozaeta that members of another El Monte “group,” the Hicks, were not welcome to join the Flores gang. This line of questioning had no relevance to establishing that the witnesses and appellant were close associates. Moreover, it suggested to the jury that hostilities existed between the two youth gangs. Given the widespread publicity concerning violence between rival youth gangs, the jury may well have assumed that members of the Flores gang were accustomed to using violence to further their interests.\nEven more serious was the prosecutor’s line of questioning which left the impression that the attempted robbery of the 7-Eleven store was a gang operation. One prosecution witness testified that he thought the assailant had been driven from the scene of the attempted robbery in a light blue Volkswagen. The prosecutor asked one defense witness whether any of his friends owned a Volkswagen. When the witness, who had admitted he was a Flores gang member, responded affirmatively, the prosecutor queried whether any of these friends were members of the Flores gang. The trial court ultimately sustained defense counsel’s objection, and the witness did not answer the question. However, the suggestion advanced by the prosecutor that the attempted robbery was a gang operation remained with the jury.\nThus, the trial court’s error in admitting the evidence of common membership in the Flores gang was compounded by the prosecutor’s broad inquiries suggesting that the gang was involved in criminal activities. These questions made it a near certainty that the jury viewed appellant as more likely to have committed the violent offenses charged against him because of his membership in the Flores gang.\nAppellant also contests the admissibility of evidence concerning his drug use and addiction. The rule applicable here is that evidence of an accused’s narcotics addiction is inadmissible where it “tends only remotely or to an insignificant degree to prove a material fact in the case . . . (See People v. Davis (1965) 233 Cal.App.2d 156, 161 [43 Cal.Rptr. 357].)\nPrior cases have upheld the admission of evidence of an accused’s narcotics addiction where the accused was charged with a violation of the Health and Safety Code or where obtaining narcotics was the direct object of the crime committed. (People v. Morales (1979) 88 Cal.App. 3d 259, 264 [151 Cal.Rptr. 610] [possession of heroin]; People v. Copeland (1959) 169 Cal.App.2d 713, 715 [338 P.2d 1] [forgery of drug prescription]; People v. O’Brand (1949) 92 Cal.App.2d 752, 754 [207 P.2d 1083] [burglary of drugstore to steal narcotics].) However, in cases where the object of the charged offense was to obtain money or an item other than narcotics, evidence of the accused’s narcotics use has been uniformly found inadmissible. (People v. Bartlett (1967) 256 Cal. App.2d 787, 793-794 [64 Cal.Rptr. 503] [theft of spark plugs from service station]; People v. Davis, supra, 233 Cal.App.2d at pp. 161-162 [robbery of money from liquor store]; People v. Enriquez (1961) 190 Cal.App.2d 481, 485 [11 Cal.Rptr. 889] [attempted robbery of money from grocery store]; People v. Guiterrez (1957) 152 Cal.App.2d 115, 122-123 [312 P.2d 291] [áttempted burglary of clothing store].)\nAs the Bartlett court found, the evidence’s “probative value to show motive [is] far outweighed by its tendency to incite a jury to resolve the issue of guilt or innocence on [an accused’s] character rather than on proof of the essential elements of the crime.” (People v. Bartlett, supra, 256 Cal.App.2d at p. 794.)\nThe impact of narcotics addiction evidence “upon a jury of laymen [is] catastrophic.... It cannot be doubted that the public generally is influenced with the seriousness of the narcotics problem ... and has been taught to loathe those who have anything to do with illegal narcotics in any form or to any extent.” (People v. Davis, supra, 233 Cal.App.2d at p. 161.)\nIn this case, the prosecution was permitted to introduce evidence of appellant’s narcotics addiction to establish a financial motive for the attempted robbery of the 7-Eleven store. The witnesses testified at great length about appellant’s physical condition at the time of his arrest, the length of time appellant had been using narcotics, and the alleged size and value of appellant’s heroin habit.\nThis testimony tended “only remotely” to prove that appellant had committed the attempted robbery of money from the 7-Eleven store. In addition, the probative value of the evidence was substantially outweighed by the inflammatory effect of the testimony on the jury. Hence, admission of the testimony concerning appellant’s use of narcotics was improper.\nIII.\nAppellant next contends that the cumulative prejudice resulting from the trial court’s erroneous evidentiary rulings requires reversal of his conviction. The record of the trial supports this contention. Absent the several evidentiary errors, it is reasonably probable that the jury would not have convicted appellant of the charged offenses. (People v. Watson (1956) 46 Cal.2d 818, 836 [299 P.2d 243].)\nThe prosecution’s case against appellant was not overwhelming. The jury deliberated for 12 hours before returning its guilty verdicts. This court has held that jury deliberations of almost six hours are an indication that the issue of guilt is not “open and shut” and strongly suggest that errors in the admission of evidence are prejudicial. (See People v. Woodard (1979) 23 Cal.3d 329, 341 [152 Cal.Rptr. 536, 590 P.2d 391].) Here, the jury deliberated twice as long as the jury in Woodard, a graphic demonstration of the closeness of this case.\nThe only incriminating evidence introduced by the prosecution against appellant was the identification testimony of the eyewitnesses.\n4\nBoth this court and the United States Supreme Court have recognized that eyewitness identifications are often unreliable. (United States v. Wade (1967) 388 U.S. 218, 228 [18 L.Ed.2d 1149, 1158, 87 S.Ct. 1926]; People v. Bustamante (1981) 30 Cal.3d 88, 98 [177 Cal.Rptr. 576, 634 P.2d 927].)\nAs the Supreme Court noted in Wade, “[t]he vagaries of eyewitness identification are well-known; the annals of criminal law are rife with instances of mistaken identification. [Fn. omitted.] Mr. Justice Frankfurter once said: ‘What is the worth of identification testimony even when uncontradicted? The identification of strangers is proverbially untrustworthy. .. .’ [Citation.]” (United States v. Wade, supra, 388 U.S. at p. 228 [18 L.Ed.2d at p. 1158].) Eyewitness identifications are especially unreliable where the witnesses identify a member of a race or ethnic group other than their own. (See, e.g., Note, Did Your Eyes Deceive You? Expert Psychological Testimony on the Unreliability of Eyewitness Identification (1977) 29 Stan.L.Rev. 969, 982; Sobel, Eyewitness Identification: Legal and Practical Problems (2d ed. 1981) § 9.7(b).)\nIn addition to the cross-cultural nature of the identifications in this case, other compelling considerations raise further doubts about the accuracy of the identification testimony. First, the witnesses’ estimates of the assailant’s height (5'7\" to 5'9\") did not closely approximate the height listed for appellant in the booking file (5'2\"). Each witness testified that the assailant was at least as tall as the witness himself.\n5\nIndeed, Blacksmith explained to the police that he was unable to restrain the suspect during their struggle after the shooting because the suspect was larger than he. The discrepancy of about one-half foot between the witnesses’ estimates and appellant’s size strongly suggests that the witnesses’ in-court identifications were mistaken.\n6\nAt the least, there was a close and difficult question for the jury — not this appellate court — to resolve.\nAnother factor suggesting that the in-court identifications were unreliable is the conflict as to whether the assailant had facial hair. Two of the eyewitnesses indicated that the assailant was clean shaven, a third that he wore a moustache and beard.\nFurther, the witnesses in the store observed the robber for a few seconds under extremely stressful conditions. Paul, the passing bicyclist, saw only the robber’s back as he fled from the store at dusk. Added to this is the fact that the witnesses had difficulty in positively identifying appellant from mug shot folders and a lineup prior to the trial. Not a single witness consistently identified appellant with certainty.\nThus, the record reveals that the identification testimony upon which the prosecution based its case was inconsistent. The case was close. The prosecutor recognized this fact when he continually stressed in his closing argument that appellant was a narcotics addict and was affiliated with the El Monte Flores gang. On several occasions, the prosecutor reminded the jury that appellant and his witnesses were members of the Flores and insinuated that the Flores organization was not simply an innocent group of youths living in the samé neighborhood.\nThe prosecutor also discussed appellant’s heroin addiction eight separate times, arguing that appellant’s motive in attempting the robbery was to obtain money to support his habit. Typical of the tone and content of the argument is the following excerpt: “[The appellant] is a [heroin] user that needed money. He couldn’t get it from the government, he had to get it somewhere.”\nPeople v. Davis, supra, 233 Cal.App.2d 156 is closely on point. In both Davis and the present case, the prosecution relied almost entirely on identification testimony and the defense asserted an alibi. The only error committed during the Davis trial was the prosecutor’s introductian of evidence that the accused was under the influence of narcotics when arrested several days after the robbery. Nevertheless, the Davis court readily found prejudice and reversed the judgment since the jury might have inferred from the evidence that Davis was an habitual heroin user. (Id., at pp. 160-161.)\nHere, several errors occurred during appellant’s trial, and each one of these was more prejudicial than the single error found in Davis. Not only did Officer Howard describe to the jury appellant’s physical condition when arrested, but the officer testified specifically that appellant was an habitual narcotic. user who had increased his heroin intake around the time of the attempted robbery. This testimony, coupled with the parole officer’s statement that appellant had asked for money two days after the robbery attempt, made it even more likely the jury based its guilty verdicts on the improperly admitted evidence.\nUnlike the jury in Davis, appellant’s jury did not have to draw any inferences to reach the conclusion that appellant was an addict. Howard’s testimony explicitly marked appellant as an addict and a gang member, two facts which supported the prosecution’s sole explanation as to why appellant would attempt to rob a 7-Eleven store.\nHad the evidence pertaining to appellant’s narcotics addiction and affiliation with the Flores gang not been admitted, it is reasonably probable that a result more favorable to appellant would have been reached by the jury. Appellant should not have been convicted of attempted robbery because he was a heroin addict and/or a member of a Chicano gang. He should have been convicted only if sufficient evidence was presented to prove that he committed the crimes. Since it is reasonably probable that the jury made its determination of guilt based on appellant’s status as a heroin addict and a Chicano gang member rather than on evidence connecting him to the crimes, the judgment of conviction must be reversed.\nIV.\nAppellant raises three additional claims of error. Although the conviction must be reversed on the basis of the evidentiary errors discussed above, these issues are addressed for the guidance of the trial court on retrial.\nAppellant contends that the trial court erred in finding that the arresting officers had probable cause to arrest him. Accordingly, he claims that the photographic identifications which were the fruits of his arrest should be suppressed.\nIn a proceeding to determine the existence of probable cause, the trial court is vested with “the power to judge the credibility of the witnesses, resolve any conflicts in the testimony, weigh the evidence and draw factual inferences .... On appeal all presumptions favor the exercise of that power, and the trial court’s findings on such matters, whether express or implied, must be upheld if they are supported by substantial evidence.” (People v. Lawler (1973) 9 Cal.3d 156, 160 [107 Cal.Rptr. 13, 507 P.2d 621]; see also People v. Leyba (1981) 29 Cal.3d 591, 596-598 [174 Cal.Rptr. 867, 629 P.2d 961].)\nHere, the police received a tentative identification of appellant as the robber of the 7-Eleven store. Subsequently, the investigating detective came upon appellant in the hallway of the courthouse. Appellant was attending a preliminary hearing in an unrelated case. According to the detective’s testimony, appellant’s eyelids appeared “droopy” and his movements “lethargic.” The detective suspected that appellant was under the influence of drugs or alcohol. Not wanting to interrupt the preliminary hearing to investigate appellant’s condition, the detective arranged to have two police officers wait for appellant outside the courthouse.\nAfter the hearing, appellant left the courthouse and entered his car on the second level of the adjacent parking area. The officers testified that appellant proceeded to drive down the exit ramp towards their police cruiser. Suddenly, appellant came to a stop and reversed his direction. The officers followed in their cruiser. They observed appellant accelerate rapidly up the ramp and drive recklessly around the parking area. Appellant finally left his car and approached the police officers. He appeared “angry,” waved his arms, and complained loudly about police “harassment.”\nWhen appellant calmed down, the officers noticed that appellant’s pupils were dilated and did not react to light. They also observed recent puncture wounds on appellant’s arms. On the basis of these observations, appellant’s conduct in the parking area, and his reported condition in the courthouse, the officers arrested appellant for using and being under the influence of a controlled substance. (Health & Saf. Code, § 11550.)\nAppellant and his counsel during the preliminary hearing disputed that appellant had the appearance of being under the influence of drugs at the courthouse. Appellant also denied driving his car recklessly in the parking area. According to his testimony, the officers approached him as soon as he entered his car. After complaining to the police officers of “harassment” and showing them the puncture wounds on his arms, he was arrested.\nThe trial court resolved the conflicts in the witnesses’ testimony in favor of the police officers. Since this result is supported by the substantial evidence of drug use detailed above, it must be upheld. (People v. Lawler, supra, 9 Cal. 3d at p. 160.) This court may not independently reweigh the credibility of the witnesses. (See, e.g., People v. North (1981) 29 Cal.3d 509, 514 [174 Cal.Rptr. 511, 629 P.2d 19].)\nThe police officers articulated facts sufficient to raise a reasonable suspicion that appellant was using or under the influence of a controlled substance. (Health & Saf. Code, § 11550.) Appellant’s physical symptoms and unusual behavior in the courthouse parking area justified the arresting officers’ suspicions. Accordingly, the trial court’s denial of appellant’s motion to suppress the photographic identifications was proper.\nAppellant next contends that the court erred in sentencing him for attempted murder in the first degree (§§ 664, 187), because the punishment exceeded the statutorily prescribed term for assault with intent to commit murder (former § 217). Asserting that these offenses proscribe identical conduct, appellant argues that the trial court should have sentenced him in accordance with the penalty provisions of former section 217\n7\nrather than under the general attempt statute (§ 664).\nThis contention was recently considered and rejected by this court in People v. Collie (1981) 30 Cal.3d 43 [177 Cal.Rptr. 458, 634 P.2d 534]. “[Appellant] was convicted of attempted murder in the first degree, for which premeditation and deliberation are prerequisites. These elements are unnecessary to establish an assault with intent to commit murder. [Citation.] Hencp the more serious nature of [appellant’s] crime justifies imposition of the more severe penalty. [Citation.]” (Id., at p. 63.)\nAppellant’s final contention is that the trial court erred in using the single act of firearm use (§ 12022.5) to enhance his sentences for both attempted murder and attempted robbery. He relies on In re Culbreth (1976) 17 Cal.3d 330 [130 Cal.Rptr. 719, 551 P.2d 23], which held that section 12022.5 may be invoked only once where “all the charged offenses are incident to one objective and effectively comprise an indivisible transaction .. ..” (In re Culbreth, supra, 17 Cal.3d at p. 333; see also People v. Chavez (1980) 26 Cal. 3d 334, 365 [161 Cal.Rptr. 762, 605 P.2d 401]; People v. Miller (1977) 18 Cal.3d 873, 887 [135 Cal.Rptr. 654, 558 P.2d 552].)\nThe prosecution does not contest that the offenses for which appellant was convicted constituted an “indivisible transaction.” Rather, it maintains that statutory amendments to the Penal Code have impliedly abolished the Culbreth rule. Their theory is that the deterrent purpose of section 12022.5, which formed the basis for the Culbreth rule, is no longer applicable. (See In re Culbreth, supra, 17 Cal.3d at p. 333.) Under the present determinate sentencing law, “the purpose of imprisonment for crime is punishment.” (§ 1170, subd. (a)(1).) It is asserted that consistent with this objective, the Legislature amended section 12022.5 to require an across-the-board uniform enhancement of two years for all felonies involving firearm use. (Stats. 1976, ch. 1139, § 305, p. 5162.)\n8\nThus, the prosecution maintains that a single enhancement for firearm use in this case “does not accurately reflect the proportionate gravity of the offenses and ... does not serve the policy underlying determinate sentencing.”\nThe analysis of People v. Edwards (1981) 117 Cal.App.3d 436 [172 Cal.Rptr. 652] is directly on point. As explained by the Court of Appeal, when the Legislature last amended sections 1170, 1170.1 and 12022.5, it did not specifically address the Culbreth issue. (Id., at p. 447.) “Hence, none of the statutory changes pertaining to the DSL, with the possibility of one exception, mentioned any intent to abolish the single-occasion rule ... (Ibid.)\n9\nThe well-settled rule of statutory construction is that legislative enactments should not be construed “‘to overthrow long-established principles of law unless such [an] intention is made clearly to appear either by express declaration or by necessary implication.’” (Id., at pp. 447-448, quoting from County of Los Angeles v. Frisbie (1942) 19 Cal.2d 634, 644 [122 P.2d 526].)\nThus, the Edwards court found that the Culbreth rule remained valid despite the statutory changes resulting from enactment of the determinate sentencing law. “[T]o say that Culbreth is no longer valid would be to rely too heavily on the silence of the Legislature. Likewise, to say that Culbreth no longer applies because of its apparent exclusion under Penal Code section 1170.1, subdivision (h), would ignore the maxim of statutory construction that when a statute expresses certain exceptions to a general rule, other exceptions are necessarily excluded.” (People v. Edwards, supra, 117 Cal.App.3d at p. 448.) Therefore, Culbreth prohibits the trial court from adding a firearm use enhancement to both sentences imposed on appellant.\nV.\nIn this case, the trial court committed serious evidentiary errors. The jury was confronted with an extremely close question as to whether appellant was the man responsible for the crimes charged. The evidence raised strong doubts as to the reliability of the eyewitness identifications. .In allowing the prosecutor to introduce evidence portraying appellant as a Chicano gang member predisposed to commit violent crimes and as a heroin addict desperate to obtain money to support his habit, the trial court ensured that the jury would reach a verdict based on improper evidence. As a direct result, the judgment of conviction must be and hereby is reversed.\nBroussard, J., and Pacht, J.,\n*\nconcurred.",
                "type": "majority",
                "author": "BIRD, C. J."
            }, {
                "text": "NEWMAN, J.\nI concur in reversing the conviction because I\nbelieve that admission of the heroin addiction evidence was prejudicial error. That evidence tainted the jury’s evaluation not of the witnesses’ credibility but of defendant’s motive, “brand[ing] him as a habitual lawbreaker, a loathsome, unworthy person, predisposed to rob or steal to support his habit. [Defendant] is entitled to have the conflicting evidence reweighed without that kind of handicap.” (People v. Davis (1965) 233 Cal.App.2d 156, 162 [43 Cal.Rptr. 357].)_",
                "type": "concurrence",
                "author": "NEWMAN, J."
            }, {
                "text": "RICHARDSON, J.\nI respectfully dissent. The majority reverses the judgment on the ground of improper admission of testimony “concerning gang membership and drug use” by defendant. (Ante, p. 903.) In my view, the asserted “errors” were entirely harmless under the circumstances in this case.\n1. Admissibility of Common-group Membership\nDefendant asserted an alibi. Defense witnesses Ozaeta, Reeves, Valenzuela, and defendant himself, testified that he was elsewhere during the offense. On cross-examination, and over defendant’s objections, the prosecution was permitted to establish that defendant and his witnesses each belonged to a youth group known as the El Monte Flores. The majority’s accusation that the prosecutor “portray[ed] appellant as a Chicano gang member predisposed to commit violent crimes” {ante, p. 914) seriously misstates the record. The prosecutor made no references whatever to “gangs,” “Chícanos,” or “violent crimes,” and he offered no evidence on these subjects. As the record shows, the prosecutor was merely permitted to show that defendant and his alibi witnesses were each members of the same youth group. Defendant’s own witness described the group as “just good friends that are in our neighborhood.” The prosecutor offered no evidence to refute that benign characterization. Subsequently, defense counsel elicited the further information that the group consisted of 250-300 members and was believed by the police to be a “gang.”\nThe majority holds that the trial court abused its discretion in permitting the prosecution to introduce evidence pertaining to the group membership shared by defendant and defense witnesses. In my view, the issue is controlled by In re Wing Y. (1977) 67 Cal.App.3d 69, 79 [136 Cal.Rptr. 390], a case which the majority conveniently ignores.\nIn Wing Y., during the course of a wardship proceeding, the prosecutor cross-examined defense witnesses regarding their membership with defendant in the Wah Ching, a Chinatown gang. Unlike the present case, evidence was also introduced regarding the gang’s past criminal activities. The Wing Y. court acknowledged the general proposition, fully applicable here, that “a witness may, on cross-examination, be asked about group membership he shares with a party to the action, on the theory that such common membership is a factor that tends to impeach a witness’ testimony by establishing bias.... Thus, the prosecution in the instant case properly could inquire of [defense] witnesses ... regarding their friendship with Wing, including their common group membership, as a means of attacking their credibility as witnesses, by establishing a bias in favor of the minor.” (67 Cal.App.3d at pp. 76-77, italics added; see also People v. Dominguez (1981) 121 Cal.App.3d 481, 499 [175 Cal.Rptr. 445]; People v. Perez (1981) 114 Cal.App.3d 470, 477 [170 Cal.Rptr. 619] [gang membership admissible if relevant]; People v. James (1976) 56 Cal.App.3d 876, 886 [128 Cal.Rptr. 733]; People v. Avila (1938) 29 Cal.App.2d 627, 631 [85 P.2d 200]; Evid. Code, § 780, subd. (f).)\nThe court in Wing Y. Concluded, however, that it was improper to introduce evidence of both (1) defendant Wing’s gang membership, based upon hearsay and reputation evidence rather than upon the personal knowledge of the testifying officer; and (2) the gang’s supposed criminal activities. (67 Cal.App.3d, at pp. 77-79.) The court stressed that, apart from its use for impeachment purposes, evidence of gang membership ordinarily has no “‘tendency in reason’ to prove a disputed fact, i.e., the identity of the person who committed the charged offense. Membership in an organization does not lead reasonably to any inference as to the conduct of a member on a given occasion. Hence, the evidence was not relevant! It allowed, on the contrary, unreasonable inferences to be made by the trier of fact that the. minor Wing was guilty of the offense charged on the theory of ‘guilt by association.’” (P. 79, italics in original.)\nThe case before us is readily distinguishable from Wing Y Here, in questions pointed to the subject of the group membership shared by defendant and his witnesses, the prosecution relied on neither hearsay nor reputation evidence, but upon the direct knowledge of the witnesses. Moreover, my review of the record discloses that no testimony was elicited, nor prosecutorial suggestions advanced, regarding any criminal activities by the group’s members. Thus, the majority’s assertion that the jury “undoubtedly identified” the group as a criminal gang (ante, p. 905) is totally speculative and unfounded.\nIn any event, had defendant believed that the jury might infer some improper gang activities by El Monte Flores, he could readily have sought appropriate limiting instructions or an admonition which would have confined the jury’s consideration of such evidence to impeachment purposes. Having failed to request such an admonition or instruction, defendant cannot now complain that evidence, properly admissible for impeachment purposes, was inadmissible to prove his guilt or discredit his character. This is the clear implication of section 355 of the Evidence Code. (See People v. Collie (1981) 30 Cal.3d 43, 63-64 [177 Cal.Rptr. 458, 634 P.2d 534] and fn. 19, disapproving People v. Williams (1970) 11 Cal.App.3d 970, 976-978 [90 Cal.Rptr. 292].)\n2. Admissibility of Defendant’s Drug Use and Addiction\nOne of the arresting officers testified, over defendant’s objection, that when he was arrested defendant appeared to be under the influence of PCP (phencyclidine), that his arm bore puncture marks indicating recent heroin injections, and that in the officer’s opinion defendant was a heroin addict with a daily habit costing between $25 and $75 daily. Such evidence was adduced for the sole purpose of establishing a possible financial motive for the attempted robbery with which defendant was charged. Defendant contends that any evidence of his drug use and narcotic addiction was inadmissible as being overly prejudicial when weighed against its slight probative value in this case. (Evid. Code, § 352.) I agree that the evidence was inadmissible. However, I would find the error harmless under the circumstances in this case.\nPrior cases have upheld the admission of evidence of the defendant’s addiction or use of narcotics where such evidence is probative of defendant’s motive for committing a drug-related crime. (People v. Copeland (1959) 169 Cal.App.2d 713, 715 [338 P.2d 1] [forgery of drug prescriptions]; People v. O’Brand (1949) 92 Cal.App.2d 752, 754 [207 P.2d 1083] [burglary to steal narcotics]; see People v. Morales (1979) 88 Cal.App.3d 259, 264 [151 Cal.Rptr. 610] [possession or sale of narcotics].) Such evidence is potentially inflammatory and, in light of the possible prejudice to the defendant from disclosure of such evidence to the trier of fact, the cases preclude its admission for purposes of establishing a motive to commit those offenses which are unrelated to narcotics. (People v. Bartlett (1967) 256 Cal.App.2d 787, 793-794 [64 Cal.Rptr. 503] [burglary]; People v. Davis (1965) 233 Cal.App.2d 156, 161-162 [43 Cal.Rptr. 357] [robbery]; People v. Enriquez (1961) 190 Cal.App.2d 481, 485 [11 Cal.Rptr. 889] [robbery/murder]; People v. Guiterrez (1957) 152 Cal.App.2d 115, 122-123 [312 P.2d 291] [attempted burglary].) As expressed by the Davis court, “The law entitled appellant to stand before the jury presumptively innocent and of good character. In characterizing him as a narcotics user, ... the prosecution branded him as a habitual lawbreaker, a loathsome, unworthy person, predisposed to rob or steal to support his habit.” (P. 162.)\nOn the other hand, I cannot say that the error, standing alone, had such a grave impact as to require reversal of the judgment. Three defense witnesses corroborated defendant’s alibi testimony. Even if the evidence of defendant’s drug habit may have led the jury to doubt defendant’s own version of events, no reason is suggested why that evidence would have cast doubts on the veracity of defendant’s witnesses, who were not similarly tainted. Moreover, at trial defendant was positively identified as the gunman by four eyewitnesses, although their pretrial identifications were somewhat clouded. The jury was thus confronted with a credibility duel between three alibi witnesses and four eyewitnesses. Having examined the entire record, I do not believe that it is reasonably probable that a result more favorable to defendant would have been reached if the drug use or addiction evidence had not been admitted. There thus occurred no miscarriage of justice under article VI, section 13, of the California Constitution. (See People v. Watson (1956) 46 Cal.2d 818, 834 [299 P.2d 243].)\nI would affirm the judgment and remand for resentencing under In re Culbreth (1976) 17 Cal.3d 330, 335 [130 Cal.Rptr. 719, 551 P.2d 23], and People v. Edwards (1981) 117 Cal.App.3d 436, 447-448 [172 Cal.Rptr. 652].\nMosk, J., concurred.\nOn July 22, 1982, the dissenting opinion by Justice Richardson was modified to read as printed above.",
                "type": "dissent",
                "author": "RICHARDSON, J."
            }]
        },
        "status": "ok"
    }
}