{
    "id": 2094128,
    "url": "https://api.case.law/v1/cases/2094128/?format=json",
    "name": "W. H. WATTENBURG and William P. Owens, Appellants, v. UNITED STATES of America, Appellee",
    "name_abbreviation": "Wattenburg v. United States",
    "decision_date": "1968-01-19",
    "docket_number": "No. 21301-A",
    "first_page": "853",
    "last_page": "859",
    "citations": [
        {
            "type": "official",
            "cite": "388 F.2d 853"
        }
    ],
    "volume": {
        "url": "https://api.case.law/v1/volumes/32044061419727/?format=json",
        "volume_number": "388"
    },
    "reporter": {
        "url": "https://api.case.law/v1/reporters/980/?format=json",
        "full_name": "Federal Reporter 2d Series"
    },
    "court": {
        "url": "https://api.case.law/v1/courts/9th-cir/?format=json",
        "id": 8826,
        "slug": "9th-cir",
        "name": "United States Court of Appeals for the Ninth Circuit",
        "name_abbreviation": "9th Cir."
    },
    "jurisdiction": {
        "url": "https://api.case.law/v1/jurisdictions/us/?format=json",
        "id": 39,
        "slug": "us",
        "name": "U.S.",
        "name_long": "United States",
        "whitelisted": false
    },
    "casebody": {
        "status": "ok",
        "data": {
            "attorneys": [
                "Richard Haas (argued), San Francisco, Cal., Stanley C. Young, Jr., of Young & Young, Quincy, Cal., W. Austin Cooper, Sacramento, Cal., for appellants.",
                "Cecil F. Poole, U. S. Atty., San Francisco, Cal., James J. Simonelli, Sp. Asst, to U. S. Atty., Sacramento, Cal., for appellee."
            ],
            "opinions": [
                {
                    "type": "majority",
                    "text": "HAMLEY, Circuit Judge:\nW. H. Wattenburg and William P. Owens were jointly charged, tried before a jury, and convicted, of stealing and conspiring to steal approximately one thousand red fir trees, Christmas-tree size, belonging to the United States. On their appeals, consolidated for disposition here, they argue that neither count of the indictment states an offense, the trial court erred in denying their motions to suppress certain evidence, admissible evidence was prejudicially excluded, the evidence does not support the convictions, and the court erred in instructing the jury.\nWe first consider the contention that the trial court erred in denying defendants’ motions to suppress certain evidence. Such a motion was first made on behalf of Owens, prior to trial, in connection with an indictment in which only he was named a defendant, and was denied. After that indictment had been superseded by the present one in which both Wattenburg and Owens were named, a pre-trial motion to suppress was made on behalf of Wattenburg and denied. During the course of the trial, both Wattenburg and Owens renewed their motions to suppress, and the motions were again denied.\nAll of the motions to suppress were made on the ground that the evidence in question was obtained as the result of an illegal search and seizure. The evidence relevant to this contention, viewed in a light most favorable to the Government, is stated below.\nThe Government charged that the trees had been cut and removed from Government lands in sections 21 and 22 of Township 27 North, Range 11 East, in Plumas National Forest, Plumas County, California. Dr. W. H. Wattenburg, son of defendant Wattenburg, held nine unpatented mining claims located in the approximate center of section 22. He was also a joint tenant in four forest parcels, comprising sixty-five acres in all, in the Wilcox Valley area of section 23, immediately to the east of section 22. In Greenville, some thirty miles by road from these forest properties, Dr. Wattenburg and his wife owned a motel known as Hideaway Lodge. Defendant Wattenburg resided at and operated this motel, and during the period here in question Owens rented a room at the lodge which he sometimes occupied.\nIn the summer of 1965, Dr. Wattenburg decided to harvest Christmas trees from the four parcels in Wilcox Valley. He showed his father, defendant Wattenburg, the area he wished to cut and gave the latter a power of attorney permitting him to carry out the harvest. The operation was to be conducted on behalf of Wattenburg Lumber Company, a sole proprietorship owned by Dr. Wattenburg. Defendant Wattenburg received a salary of $3,500 a year from this corporation, and no other compensation.\nIn October 1965, defendant Wattenburg obtained transportation tags from the county sheriff’s office which, under Calif.Penal Code § 384c (1963), were needed before the Christmas trees could be transported over state and county roads. He then entered into a written contract with Owens under which the latter agreed to cut the trees. Defendant Wattenburg took Owens to the Wilcox Valley area and showed him the trees which were to be cut. The actual cutting was done by Owens and men under his supervision.\nOn November 4, 1965, during the course of a routine inspection of forest areas in sections 21 and 22, Dwayne Siex, a timber management assistant with the U. S. Forest Service, observed conditions which led him to believe that trees of Christmas-tree size were being cut and removed from Government lands without authority. An immediate investigation was conducted, led by Mervin O. Adams, a criminal investigator for the Forest Service. In connection with this investigation, Adams and several other Forest Service officers conducted a search of a stockpile of cut trees, Christmas-tree size, located near the Hideaway Lodge.\nThe principal purpose of the search, which began at 2:35 p. m. on November 8, 1965, and lasted until about 9:00 p. m. on that day, was to make some “matches” with stump cuts which had been taken from some stumps on the Government lands in sections 21 and 22.\n1\nNine “matches” were made, and the nine matching trees were seized from the stockpile. In addition to this evidence of matching, a paint smudge on the trunk of one of the nine trees taken from the stockpile was found to be “similar” to the paint on a vehicle used by Owens and his helpers. “Wafers” cut from the nine trees, and the paint-smudged tree trunk were introduced in evidence and Government witnesses orally testified to what they had observed during the search.\nThe Forest Service officer obtained a search warrant prior to looking through and seizing trees from this stockpile. However, the Government concedes that this warrant was invalid because issued by the judge of a local justice court. See Rule 41(a), Federal Rules of Criminal Procedure. This search was not made incident to an arrest. The Government does not assert that a search without waiting for a valid.search warrant was necessary in order to preserve evidence. The Government concedes that neither Wattenburg nor Owens consented to the search.\nRelying on these circumstances, Wattenburg and Owens urged in the trial court that the search and seizure' was unreasonable within the meaning of the Fourth Amendment. The Government, however, argued that the search and seizure was not protected by the Fourth Amendment because it was not made in or about defendants’ “house,” but in an open field. Defendants opposed this contention, but the trial court applied the so-called “open field” doctrine in denying the motions to suppress made during the trial. On this appeal the parties renew the debate on whether the search in question is unprotected by the Fourth Amendment because of the area in which it occurred.\nThe Fourth Amendment protects the right of the people to be secure in their “persons, houses, papers, and effects. * * * ” against unreasonable searches and,seizures. Pointing to this language, Justice Holmes said for the Supreme Court, in Hester v. United States, 265 U.S. 57, 44 S.Ct. 445, 68 L.Ed. 898, that the special protection afforded by the Fourth Amendment “is not extended to the open fields.” Justice Holmes added: “The distinction between the latter and the house is as old as the common law. 4 Bl.Comm. 223, 225, 226.” (265 U.S. at 59, 44 S.Ct. at 446)\nEver since this Supreme Court pronouncement in Hester, the “open field” doctrine has been uniformly recognized and applied where, under the facts of a particular case, it was held that the search and seizure had occurred in an open field.\nThe kinds of warrantless searches which have been upheld under the “open field” doctrine are well illustrated in the cases (which the Government calls to our attention. In Hester, supra, the enforcement officers obtained their information that a crime was being committed by concealing themselves at a point from fifty to a hundred yards from the defendant’s residence. In United States v. Hassell, 6 Cir., 336 F.2d 684, 685, the search for a still was made about 250 yards from the defendant’s house. In Care v. United States, 10 Cir., 231 F.2d 22, 24-25, the search was made in a plum thicket approximately half a mile away from defendant’s residence, and in a cave in a plowed field across a road and moré than a long city block from the home. In Janney v. United States, 4 Cir., 206 F.2d 601, 602, an enforcement officer obtained the information that a crime was being committed by concealing himself beside a hog pen on the other side of a wire fence which was about one hundred feet west of the house.\n2\nThe undisputed evidence in the case before us establishes circumstances differing radically from those present in the foregoing cases. As a Government witness testified, the stockpile of Christmas trees was on the premises known as Hideaway Lodge, the pile being among some standing trees. He further testified the distance between the stockpile and the lodge was from twenty to thirty-five feet, and that the stockpile was about five feet from a parking area used by personnel and patrons of the lodge. This witness characterized the position of the stockpile as “immediately behind” and “immediately adjacent” to the lodge. The trial court commented that the trees were “in Mr. Wattenburg’s back yard.” As stated above, Wattenburg operated and lived at the Hideaway Lodge, and Owens rented a room there which he sometimes occupied.\nThe protection afforded by the Fourth Amendment, insofar as houses are concerned, has never been restricted to the interior of the house, but has extended to open areas immediately adjacent thereto. The differentiation between an immediately adjacent protected area and an unprotected open field has usually been analyzed as a problem of determining the extent of the “curtilage.”\n3\nIn Care v. United States, 10 Cir., 231 F.2d 22, the following statement is made concerning the principles ordinarily applied in deciding whether the search took place in a protected curtilage:\n“Whether the place searched is within the curtilage is to be determined from the facts, including its proximity or annexation to the dwelling, its inclusion within the general enclosure surrounding the dwelling, and its use and enjoyment as an adjunct to the domestic economy of the family.” (231 F.2d at 25)\n4\nApplying here this means of differentiating between a protected area immediately adjacent to a house, and an open field unprotected by the Fourth Amendment, we have no hesitancy in holding that the stockpile of Christmas trees here in question was within the curtilage of Wattenburg’s abode at the Hideaway Lodge, and therefore, at least as to him, protected by the Fourth Amendment.\nWe wish to add, however, that it seems to us a more appropriate test in determining if a search and seizure adjacent to a house is constitutionally forbidden is whether it constitutes an intrusion upon what the resident seeks to preserve as private even in an area which, although adjacent to his home, is accessible to the public. See Katz v. United States, 389 U.S. 347, 88 S.Ct. 507, 19 L.Ed.2d 576, decided December 18, 1967. As the Supreme Court said in Katz, “the Fourth Amendment protects people, not places.”\nThe “curtilage” test is predicated upon a common law concept which has no historical relevancy to the Fourth Amendment guaranty.\n5\nIn Jones v. United States, 362 U.S. 257, 266, 80 S.Ct. 725, 733, 4 L.Ed.2d 697, the Supreme Court warned, in connection with another search and seizure problem, that:\n“[I]t is unnecessary and ill-advised to import into the law surrounding the constitutional right to be free from unreasonable searches and seizures subtle distinctions, developed and refined by the common law in evolving the body of private property law * * *.”\nIf the determination of such questions is made to turn upon the degree of privacy a resident is seeking to preserve as shown by the facts of the particular case, rather than upon a resort to the ancient concept of curtilage,' attention will be more effectively focused on the basic interest which the Fourth Amendment was designed to protect. As the Supreme Court recently said in Camara v. Municipal Court of City and County of San Francisco, 387 U.S. 523, 528, 87 S.Ct. 1727, 1730, 18 L.Ed.2d 930:\n“The basic purpose of this Amendment, as recognized in countless decisions of this Court, is to safeguard the privacy and security of individuals against arbitrary invasions by governmental officials.”\n6\nMeasured by the test we suggest, Wattenburg was, without doubt, protected by the Fourth Amendment from a warrantless search and seizure of the kind described above. In the daytime and in the dark, from- 2:35 p. m. to 9:00 p. m. on November 8, 1965, several law enforcement officials meticulously went through the stockpile of trees located in the backyard of his abode and no more than thirty-five feet from the building. It must have been necessary to move most of the trees from one place to another in order to make the kind of examination which the officers carried on. Lights must have been required as the men moved about after dark and there was undoubtedly a certain amount of noise. There can be no doubt that Wattenburg, in placing the stockpile this close to his place of residence, sought to protect it from this kind of governmental intrusion.\nThe search and seizure was therefore illegal as to Wattenburg.\nIn this court the Government has not renewed the argument which it advanced in the trial court, that Owens did not have standing to complain of the search and seizure we have been discussing. But, in any event, Owens did have standing to object to that search and seizure, not necessarily because of his status as a roomer at Hideaway Lodge, but because one of the essential facts the Government sought to prove against Owens was that he was a joint possessor of the Christmas trees. See Jones v. United States, 362 U.S. 257, 263-264, 80 S.Ct. 725, 4 L.Ed.2d 697; United States v. Jeffers, 342 U.S. 48, 52, 72 S.Ct. 93, 96 L.Ed. 59. Moreover, apart from standing, Owens was so prejudiced by the admission of illegally seized evidence, that his conviction was thereby fatally infected. See McDonald v. United States, 335 U.S. 451, 456, 69 S.Ct. 191, 93 L.Ed. 153.\nThe motions of both Wattenburg and Owens to suppress the evidence obtained by the search of the Christmas tree stockpile should have been granted. Without the evidence obtained as a result of this search, the Government has no case against either defendant.\nThe judgments are reversed and the causes are remanded with directions to dismiss the indictment.\n1 . A stump cut is a portion of a tree stump which is severed from the top of the stump in an effort to later match the portion cut with the tree previously removed,\n2 . In support of its “open field” theory, the Government also cites two Ninth Circuit cases: Carney v. United States, 9 Cir., 163 F.2d 784, and Gay v. United States, 9 Cir., 8 F.2d 219. However, in neither of these decisions was the “open field” concept discussed or applied. The rule applied in both of these cases was that a garage, occupied, and used only for garage purposes, is not a “house,” and may be searched without obtaining a search warrant. We have no such faetual situation in tlie case before us and therefore need not decide whether our court would today adhere to the Carney and Cay cases. Cf., Taylor v. United States, 286 U.S. 1, 52 S.Ct. 466, 76 L. Ed. 951. The “open field” doctrine was applied in the Ninth Circuit case of Koth v. United States, 9 Cir., 16 F.2d 59, but the search there in question took place more than a quarter of a mile from the house.\n3 . See, for example, McDowell v. United States, 8 Cir., 383 F.2d 599, 603; Rosencranz v. United States, 1 Cir., 356 F.2d 310, 313; United States v. Potts, 6 Cir., 297 F.2d 68, 69; Hodges v. United States, 5 Cir., 243 F.2d 281, 283.\n4 . In Rosencranz v. United States, 1 Cir., 356 F.2d 310, 313, the court said:\n“This amendment [Fourth] speaks of the ‘houses’ of persons, which word has been enlarged by the courts to include the ‘curtilage’ or ground and buildings immediately surrounding a dwelling, formerly usually enclosed. The reach of the curtilage depends on the facts of a case.”\nLikewise, in United States v. Potts, 6 Cir., 297 F.2d 68, 69, the court stated:\n“Generally speaking, curtilage has been held to include all buildings in close proximity to a dwelling, which are continually used for carrying on domestic employment; or such place as is necessary and convenient to a dwelling and is habitually used for family purposes.” (Citations omitted.)\n5 . In Blackstone’s Commentaries, the concept of curtilage is discussed in connection with an exposition of common law burglary. See 4 W. Blackstone, Commentaries * 225.\n6 . Evidencing a disposition to expand previously held views as to what is entitled to protection under the Fourth Amendment, the Supreme Court in Oamara, decided on June 5, 1967, invalidated a warrantless administrative inspection of a residence and, in doing so, expressly overruled Frank v. State of Maryland, 359 U.S. 360, 79 S.Ct. 804, 3 L.Ed.2d 877, decided only eight years previously. And in the companion case of See v. City of Seattle, 387 U.S. 541, 87 S.Ct. 1737, 18 L.Ed.2d 943, a warrantless administrative inspection of a commercial warehouse was held illegal although it did not involve a search of individuals, a house, papers or effects. The Court said:\n“The businessman, like the occupant of a residence, has a constitutional right to go about his business free from unreasonable official entries upon his private commercial property.” 387 U.S. at 543, 87 S.Ct. at 1739.\nIn Katz v. United States, 389 U.S. 347, 88 S.Ct. 507, 19 L.Ed.2d 576, the Fourth Amendment was held to protect individuals from having their telephone conversations within a public telephone booth overheard by Government enforcement officers by means of electronic listening and recording devices attached to the outside of the booth.\nThe considerations of privacy here envisioned are not predicated upon a general constitutional “right of privacy,” but upon a right to be free from certain kinds of governmental intrusion. See Katz v. United States, supra. It should also be noted, as the Supreme Court said in Katz, that the reach of the Fourth Amendment is not limited to the protection of individual privacy against certain kinds of governmental intrusion, “but its protections go further, and often have nothing to do with privacy at all.”",
                    "author": "HAMLEY, Circuit Judge:"
                }
            ],
            "judges": [],
            "parties": [
                "W. H. WATTENBURG and William P. Owens, Appellants, v. UNITED STATES of America, Appellee."
            ],
            "head_matter": "United States Court of Appeals Ninth Circuit.\nNo. 21301-A.\nW. H. WATTENBURG and William P. Owens, Appellants, v. UNITED STATES of America, Appellee.\nJan. 19, 1968.\nRichard Haas (argued), San Francisco, Cal., Stanley C. Young, Jr., of Young & Young, Quincy, Cal., W. Austin Cooper, Sacramento, Cal., for appellants.\nCecil F. Poole, U. S. Atty., San Francisco, Cal., James J. Simonelli, Sp. Asst, to U. S. Atty., Sacramento, Cal., for appellee.\nBefore HAMLEY and ELY, Circuit Judges, and ZIRPOLI, District Judge."
        }
    }
}